blogs/2020-10-06-raspberrypi.html
<!doctype html>
<html lang="en">
<head>
<title>如何配置树莓派</title>
<!-- 2020-10-06 Tue 20:26 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. 系统下载和安装</a></li>
<li><a href="#sec-2">2. 如何安装采用GPIO引脚的LCD触摸显示屏驱动程序</a></li>
<li><a href="#sec-3">3. 如果你的触摸屏有点不太正常</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">如何配置树莓派</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 系统下载和安装</h2>
<div class="outline-text-2" id="text-1">
<p>
老手可以自行下载并安装任意支持ARM架构的 GNU/Linux 发行版。
</p>

<p>
对于新手，建议下载树莓派基金会官方推荐的 Raspbian GNU/Linux（基于Debian）。
</p>

<p>
下载地址： 
</p>

<p>
完全版（桌面环境和推荐软件包）： <a href="https://downloads.raspberrypi.org/raspbian_full_latest.torrent">Torrent</a>   <a href="https://downloads.raspberrypi.org/raspbian_full_latest">Zip</a>
</p>

<p>
完整版（桌面环境）： <a href="https://downloads.raspberrypi.org/raspbian_latest.torrent">Torrent</a>   <a href="https://downloads.raspberrypi.org/raspbian_latest">Zip</a>
</p>

<p>
轻量版（无桌面）：<a href="https://downloads.raspberrypi.org/raspbian_lite_latest.torrent">Torrent</a>  <a href="https://downloads.raspberrypi.org/raspbian_lite_latest">Zip</a>
</p>

<p>
下载完毕之后，解压Zip文件，便可以找到对应的 img 映像文件，用来刻录映像到SD卡。
</p>

<p>
访问 <a href="https://www.balena.io/etcher/">Balena Etcher</a> 来获取最新版本的 Etcher 软件，以便将 img 映像刻录到SD卡。
</p>

<p>
如果你了解并且可以熟练使用某个其他的刻录程序，也可以使用那个程序而非Etcher来进行刻录。
</p>

<p>
Linux 以及 OS X 用户可以使用 dd 命令：
</p>

<div class="org-src-container">

<pre class="src src-sh">sudo dd <span style="color: #7590db;">if</span>=./2018-11-13-raspbian-stretch-full.img <span style="color: #7590db;">of</span>=/dev/sdX  <span style="color: #7590db;">conv</span>=fsync
</pre>
</div>

<p>
注意在img映像文件所在的目录运行此命令。
</p>

<p>
以及将`/dev/sdX`换成你的SD卡设备名。
</p>

<p>
<b>注意：dd命令将会覆盖目标设备文件系统的所有文件，如果你使用了错误的设备名，你将会失去该设备上存储的所有文件！</b>
</p>

<p>
运行完成后，你便可以将SD卡插入树莓派，接入电源，使用HDMI线将视频信号接入你的显示器，开始使用你的树莓派了。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 如何安装采用GPIO引脚的LCD触摸显示屏驱动程序</h2>
<div class="outline-text-2" id="text-2">
<p>
如果你的触摸屏插到显示屏上白屏，可能是你的触摸屏驱动没有安装。
</p>

<p>
<a href="https://github.com/goodtft/LCD-show/archive/master.zip">驱动下载链接</a> 下载完后解压。
</p>

<p>
或者使用Git：
</p>

<div class="org-src-container">

<pre class="src src-sh">git clone https://github.com/goodtft/LCD-show.git
</pre>
</div>

<p>
将解压后的文件夹拷贝到 <code>rootfs</code> 分区的 <code>/home/pi/</code> 目录下。
</p>

<p>
<b>如果你有支持HDMI输入的显示器，请将你的树莓派和显示器通过HDMI线缆连接起来，启动树莓派，并直接跳到第5步。</b>
</p>

<ol class="org-ol">
<li>在 <code>boot</code> 分区下创建一个名为 <code>SSH</code> 的空文件，注意文件不能有后缀名，这样树莓派启动之后就会自动启动SSH服务。
</li>

<li>Windows用户请下载 <a href="https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html">PuTTY</a> SSH 客户端。Linux以及OS X用户可以直接使用ssh命令。
</li>

<li>请将你的树莓派和计算机连接在同一局域网内，并在路由器开启DHCP功能，保证树莓派可以自动分配到IP地址。
</li>

<li>通过路由器查询或内网扫描工具等手段扫描到树莓派的IP地址，Windows用户输入到PuTTY中进行链接，Linux和OS X用户运行 <code>ssh pi@x.x.x.x</code> ,将 <code>x.x.x.x</code> 换成树莓派的IP地址。密码为 <code>raspberry</code> 
</li>

<li>在终端中输入： <code>cd ./LCD-show-master/ &amp;&amp; ls</code> ，找到你的触摸屏对应的配置文件。如果你是3.5吋
LCD屏，那你的配置文件就是LCD35-show，以此类推。
</li>

<li>在终端中输入 <code>chmod u+x ./file_name</code> ，将 <code>file_name</code> 换成你对应的触摸屏配置文件。
</li>

<li>在终端中输入 <code>./file_name</code> ，将 <code>file_name</code> 换成你对应的触摸屏配置文件，树莓派会重启，如果你是用HDMI接入的显示屏，请断开HDMI连接，并将你的显示屏插在对应的GPIO引脚上。
</li>

<li>重启之后，显示屏便会显示正常。
</li>
</ol>

<p>
注：
</p>

<p>
在使用LCD显示屏的情况下，HDMI输出默认关闭，如果要切换到HDMI输出，可以运行 :
</p>

<div class="org-src-container">

<pre class="src src-sh">./LCD-show-master/LCD-hdmi
</pre>
</div>

<p>
如果HDMI输出和触摸屏输出之间的切换未正常运行，请尝试在命令前加 <code>sudo</code> 再次运行，尽管不加 <code>sudo</code> 依旧会提示输入密码。
</p>

<p>
如果你想设置显示旋转，可以在 <code>./file_name</code> 命令后面接旋转角度参数，例如，旋转90度，便可以运行 <code>./file_name 90</code> 。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 如果你的触摸屏有点不太正常</h2>
<div class="outline-text-2" id="text-3">
<p>
如果你的触摸屏触摸有些问题，比如你的滑动方向和屏幕上指针的移动方向不同，可能是你的触摸屏判断坐标轴出了问题，别担心，通过很简单的配置文件更改就可以解决这个问题。
</p>

<p>
运行以下命令：
</p>


<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install xserver-xorg-input-libinput
sudo sudo mkdir /etc/X11/xorg.conf.d
sudo cp /usr/share/X11/xorg.conf.d/40-libinput.conf -r /etc/X11/xorg.conf.d/
<span style="color: #4f97d7;">cd</span> /etc/X11/xorg.conf.d/
sudo nano 40-libinput.conf
</pre>
</div>

<p>
找到TouchScreen Section：
</p>

<div class="org-src-container">

<pre class="src src-sh">Section <span style="color: #2d9574;">"InputClass"</span>
        Identifier <span style="color: #2d9574;">"libinput touchscreen catchall"</span>
        MatchIsTouchscreen <span style="color: #2d9574;">"on"</span>
        MatchDevicePath <span style="color: #2d9574;">"/dev/input/event*"</span>
        Driver <span style="color: #2d9574;">"libinput"</span>
EndSection
</pre>
</div>


<p>
如果你在触摸屏上右划，指针往上移，那么在TouchScreen Section里添加以下一行设置。
</p>

<p>
<code>Option "CalibrationMatrix" "0 -1 1 1 0 0 0 0 1</code>
</p>

<p>
如果你在触摸屏上右划，指针往左移，那么添加以下一行设置。
</p>

<p>
<code>Option "CalibrationMatrix" "-1 0 1 0 -1 1 0 0 1"</code>
</p>

<p>
如果你在触摸屏上右划，指针往下移，那么添加以下一行设置。
</p>

<p>
<code>Option "CalibrationMatrix" "0 1 0 -1 0 1 0 0 1</code>
</p>

<p>
重启即可。
</p>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="date">Created: 2020-10-06 Tue 20:26</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="http://orgmode.org">Org-mode</a> 9.3)</p>
</div>
</footer>
</body>
</html>
